added a deployement of a todo app
